app/Controllers/Admin.php

SELECT *
FROM `pages`
SELECT COUNT(*) AS `numrows`
FROM `pages`
SELECT COUNT(*) AS `numrows`
FROM `content`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `content`
WHERE `content_section` = 'hero'
---
    public function index()
    {
        $pages = $this->pageModel->findAll();
        $totalPages = $this->pageModel->countAllResults();
        $totalContent = $this->contentModel->countAllResults();
        $totalUsers = $this->userModel->countAllResults();
        $totalBanner = $this->contentModel->where("content_section", "hero")->countAllResults();