app/Controllers/Content.php

SELECT *
FROM `pages`
---
    public function index()
    {

        $pages = $this->pageModel->findAll();

SELECT *
FROM `pages`
SELECT *
FROM `pages`
WHERE `pages`.`page_id` = '17'
---
    public function newHero($id){

        $pages = $this->pageModel->findAll();
        $page = $this->pageModel->find($id);

SELECT *
FROM `pages`
---
    public function newWhyUs(){
        $pages = $this->pageModel->findAll();

SELECT *
FROM `content`
WHERE `content`.`content_id` = '28'
---
    public function createFeature(){
        $postData = new Contents($this->request->getPost());

       // Check if a new background_img is uploaded
       $backImage = $this->request->getFile("background_img");
       if ($backImage->isValid() && $backImage->getSize() > 0) {
           $newName2 = $backImage->getRandomName();
           $backImage->move("public/background_img/", $newName2);
           $postData->background_img = $newName2;
       }

        $id = $this->model->protect(false)->insert($postData);

        if($id === false){
            return redirect()->back()->with("errors",
            $this->model->errors())->withInput();
        }
        return redirect()->to("content/$id")->with("message","Content Saved");

SELECT *
FROM `pages`
---
    public function show($id){
        $pages = $this->pageModel->findAll();

SELECT *
FROM `content`
WHERE `content`.`content_id` = '52'
---
                return redirect()->to("content/$id")->with("message", "Nothing to update...");
            }else{
                $this->model->save($content);
                return redirect()->to("content/$id")->with("message", "Content Updated.");