app/Controllers/Content.php

SELECT *
FROM `pages`
---
    public function newContactUs($id){
        $pages = $this->pageModel->findAll();

SELECT *
FROM `content`
WHERE `content`.`content_id` = '36'
---
    public function createFeature(){
        $postData = new Contents($this->request->getPost());

       // Check if a new background_img is uploaded
       $backImage = $this->request->getFile("background_img");
       if ($backImage->isValid() && $backImage->getSize() > 0) {
           $newName2 = $backImage->getRandomName();
           $backImage->move("public/background_img/", $newName2);
           $postData->background_img = $newName2;
       }

        $id = $this->model->protect(false)->insert($postData);

        if($id === false){
            return redirect()->back()->with("errors",
            $this->model->errors())->withInput();
        }
        return redirect()->to("content/$id")->with("message","Content Saved");