app/Controllers/Home.php

SELECT *
FROM `pages`
---
    public function index()
    {
        $contentModel = new ContentModel();
        $pageModel = new PageModel;
        $pages = $pageModel->findAll();