app/Controllers/Pages.php

    public function delete($id){
        $page = $this->getPageOr404($id);
        //if it is posted yes

            $this->model->delete($id);

            return redirect()->to("page/show")->with("message","Page deleted");
---
SELECT *
FROM `pages`