app/Models/ContentModel.php

        public function getHeroContent()
        {
            return $this->where('content_section', 'hero')->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'hero'

        public function getFeatureContent(){
            return $this->where('content_section', 'features')->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'features'

        public function getOtherSectionContent(){
            return $this->where("content_section", "other_section")->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'other_section'

        public function getInfoSectionContent(){
            return $this->where("content_section", "info_section")->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'info_section'

        public function getPricingSectionContent(){
            return $this->where("content_section", "pricing_section")
            ->where("pages_id", "15")
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'pricing_section'
AND `pages_id` = '15'

        public function getWhyUsSectionContent(){
            return $this->where("content_section", "why_us_section")
            ->where("pages_id", "15")
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'why_us_section'
AND `pages_id` = '15'

        public function getAboutUsContent(){
            return $this->where("content_section", "about_section")
            ->where("pages_id" , "15")
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'about_section'
AND `pages_id` = '15'

        public function getTestimonialContent(){
            return $this->where("content_section", "testimonial_section")
            ->where("pages_id" , "15")
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'testimonial_section'
AND `pages_id` = '15'

        public function getContactUsContent(){
             return $this->where("content_section", "contact_us_section")
            ->where("pages_id" , "15")
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'contact_us_section'
AND `pages_id` = '15'

        public function getHeroByPage($page_id){
            return $this->where("content_section", "hero")
            ->where("pages_id", $page_id)
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'features'
AND `pages_id` = '15'

        public function getFeaturesByPage($page_id){
            return $this->where("content_section", "features")
            ->where("pages_id", $page_id)
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'features'
AND `pages_id` = '20'

        public function getOtherByPage($page_id){
            return $this->where("content_section", "other_section")
            ->where("pages_id", $page_id)
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'other_section'
AND `pages_id` = '20'

        public function getInfoByPage($page_id){
            return $this->where("content_section", "info_section")
            ->where("pages_id", $page_id)
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'info_section'
AND `pages_id` = '20'

        public function getPricingByPage($page_id){
            return $this->where("content_section", "pricing_section")
            ->where("pages_id", $page_id)
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'pricing_section'
AND `pages_id` = '20'

        public function getWhyUsByPage($page_id){
            return $this->where("content_section", "why_us_section")
            ->where("pages_id", $page_id)
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'why_us_section'
AND `pages_id` = '20'

        public function getAboutusByPage($page_id){
            return $this->where("content_section", "about_section")
            ->where("pages_id", $page_id)
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'about_section'
AND `pages_id` = '20'

        public function getTestimonialByPage($page_id){
            return $this->where("content_section", "testimonial_section")
            ->where("pages_id", $page_id)
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'testimonial_section'
AND `pages_id` = '20'

        public function getContactUsByPage($page_id){
            return $this->where("content_section", "contact_us_section")
            ->where("pages_id", $page_id)
            ->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'contact_us_section'
AND `pages_id` = '20'