app/Models/PageModel.php

    public function findBySlug($slug)
    {

        return $this->where('slug', $slug)->first();
---
SELECT *
FROM `pages`
WHERE `slug` = 'contact'
 LIMIT 1